# Intermediate SQL

## Filtering Records

#### Using AND

The following exercise combines `AND` and `OR` with the
`WHERE` clause. Using these operators together strengthens your queries and analyses of data.

You will apply these new skills now on the `films` database.

In [2]:
import cx_Oracle
import pandas as pd

def print_all():
    connection = cx_Oracle.connect(user="DATASETS_CHAN", password="123", dsn="localhost:1521/xe")
    cursor = connection.cursor()
    cursor.execute("SELECT * FROM FILMS")
    return pd.DataFrame(cursor)

def run_statement(sql):
    connection = cx_Oracle.connect(user="DATASETS_CHAN", password="123", dsn="localhost:1521/xe")
    cursor = connection.cursor()
    cursor.execute(sql)
    display(pd.DataFrame(cursor))

#### Instructions
* Select the `title` and `release_year` for all German-language films released before 2000.

In [5]:
# -- Select the title and release_year for all German-language films released before 2000
sql = """
SELECT title, release_year
FROM films
WHERE language = 'German'
    AND release_year < 2000
"""
run_statement(sql)

                                   0     1
0                         Metropolis  1927
1                      Pandora's Box  1929
2  The Torture Chamber of Dr. Sadism  1967
3                           Das Boot  1981
4                       Run Lola Run  1998
5                     Aimee & Jaguar  1999

* Update the query from the previous step to show German-language films released after 2000 rather than before.

In [12]:
# -- Update the query to see all German-language films released after 2000
sql = """
SELECT title, release_year
FROM films
WHERE language = 'German'
    AND release_year > 2000
"""
run_statement(sql)

DatabaseError: ORA-00933: SQL command not properly ended

* Select all details for German-language films released after 2000 but before 2010 using **only** `WHERE` and `AND`.

In [6]:
# -- Select all records for German-language films released after 2000 and before 2010
sql = """
SELECT *
FROM films
WHERE language = 'German'
    AND (release_year > 2000 AND release_year < 2010)
"""
run_statement(sql)

                            0     1
0             Good Bye Lenin!  2003
1                    Downfall  2004
2                Summer Storm  2004
3         The Lives of Others  2006
4  The Baader Meinhof Complex  2008
5                    The Wave  2008
6                       Cargo  2009
7                Soul Kitchen  2009
8            The White Ribbon  2009